In [45]:
#Menghapus (drop) missing values di Data Frame (NaN)

In [46]:
import pandas as pd, numpy as np

In [47]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  J8PUk6TZFI  0.468375 -0.448732  0.679122  0.618571
1  zeJE7ymMls -0.103525  0.373896 -0.363810 -0.866241
2  T7ED84nnvH       NaN  0.225937 -0.154646  0.206857
3  k5FYhAqV2r -0.519594 -0.524530 -0.772341 -0.206724
4  Cy74T0sNGu  0.780634  1.520168  0.736311  1.160042

In [48]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  J8PUk6TZFI  0.468375 -0.448732  0.679122  0.618571
1  zeJE7ymMls -0.103525  0.373896 -0.363810 -0.866241
2  T7ED84nnvH       NaN  0.225937 -0.154646  0.206857
3  k5FYhAqV2r -0.519594 -0.524530 -0.772341 -0.206724
4  Cy74T0sNGu  0.780634  1.520168  0.736311  1.160042

In [49]:
df_backup = df.copy(deep=True)

In [50]:
#Menghapus (drop) setiap kolom yang mengandung missing values di Data Frame (NaN)

In [51]:
df = df.dropna(axis='columns')
df.head()

            Z
0  J8PUk6TZFI
1  zeJE7ymMls
2  T7ED84nnvH
3  k5FYhAqV2r
4  Cy74T0sNGu

In [ ]:
#Menghapus (drop) setiap baris yang mengandung missing values di Data Frame (NaN)

In [54]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  J8PUk6TZFI  0.468375 -0.448732  0.679122  0.618571
1  zeJE7ymMls -0.103525  0.373896 -0.363810 -0.866241
3  k5FYhAqV2r -0.519594 -0.524530 -0.772341 -0.206724
4  Cy74T0sNGu  0.780634  1.520168  0.736311  1.160042
6  cIJfzl2QeZ -0.685147  0.558049 -1.227193 -0.977973

In [ ]:
#presentase missing values setiap kolom

In [56]:
df = df_backup.copy(deep=True)
df.isna().mean()

#isna akan mengumpulkan missing values tiap values
#.mean akan menghitung rata-rata atau presentasi missing values

Z    0.000000
A    0.233333
B    0.066667
C    0.066667
D    0.033333
dtype: float64

In [ ]:
#menhapus setiap kolom yg mengandung m8issing values dengan treshold
#treshold = ambang batas

In [ ]:
treshold = len(df) * 0.9
#ambang batas = 90 %
#len(df) = mencarai tahu jumlah row
#kita ingin 90% Nan

df = df.dropna(tresh = tresh)